{
  "heavyweightBoxers": [
    {
      "id": 1,
      "name": "Muhammad Ali",
      "height": "191 cm",
      "weight": "97 kg",
      "reach": "198 cm",
      "anthropometricBonus": "3",
      "punchingPower": "5",
      "defense": "9",
      "chin": "8",
      "intelligence": "10",
      "endurance":"9",
      "speed": "10",
      "total": "54",
      "totalFights": "61",
      "wins": "56",
      "winsByKO": "37",
      "losses": "5",
      "draws": "", 
      "puthImageSkillsFirst": "images/Muhammad-Ali.jpg", 
      "puthImageSkillsSecond": "images/Muhammad_Ali.jpg", 
      "puthImageBio": "images/Muhammad-Ali-info.webp",
      "bio": "Muhammad Ali (/ɑːˈliː/; born Cassius Marcellus Clay Jr.; January 17, 1942 – June 3, 2016) was an American professional boxer and activist. Nicknamed \"the Greatest\", he is regarded as one of the most significant sports figures of the 20th century and is often regarded as the greatest heavyweight boxer of all time. He held the Ring magazine heavyweight title from 1964 to 1970. He was the undisputed champion from 1974 to 1978 and the WBA and Ring heavyweight champion from 1978 to 1979. In 1999, he was named Sportsman of the Century by Sports Illustrated and the Sports Personality of the Century by the BBC."
    },
  
    {
      "id": 2,
      "name": "George Foreman",
      "height": "193 cm",
      "weight": "100 kg",
      "reach": "201 cm",
      "anthropometricBonus": "3.5",
      "punchingPower": "10",
      "defense": "8",
      "chin": "9",
      "intelligence": "8",
      "endurance":"8",
      "speed": "7",
      "total": "53.5",
      "totalFights": "81",
      "wins": "76",
      "winsByKO": "68",
      "losses": "5",
      "draws": "", 
      "puthImageSkillsFirst": "images/George-Foreman.webp", 
      "puthImageSkillsSecond": "images/George_Foreman.jpg", 
      "puthImageBio": "images/George-Foreman-info.jpg",
      "bio": "George Edward Foreman (born January 10, 1949) is an American former professional boxer, entrepreneur, minister, and author. In boxing, he competed between 1967 and 1997 and was nicknamed \"Big George\". He is a two-time world heavyweight champion and an Olympic gold medalist. As an entrepreneur, he is known for the George Foreman Grill."
    }
    ,
    {
      "id": 3,
      "name": "Ike Ibeabuchi",
      "height": "188 cm",
      "weight": "111 kg",
      "reach": "194 cm",
      "anthropometricBonus": "2.5",
      "punchingPower": "8",
      "defense": "9",
      "chin": "9",
      "intelligence": "8",
      "endurance":"9",
      "speed": "8",
      "total": "53.5",
      "totalFights": "20",
      "wins": "20",
      "winsByKO": "15",
      "losses": "0",
      "draws": "", 
      "puthImageSkillsFirst": "images/Ike_Ibeabuchi.jpg", 
      "puthImageSkillsSecond": "images/Ike-Ibeabuchi.jpg", 
      "puthImageBio": "images/Ike-Ibeabuchi-info.webp",
      "bio": "Ikemefula Charles 'Ike' Ibeabuchi (born February 2, 1973) is a Nigerian former professional boxer who competed from 1994 to 1999 in the heavyweight division. He defeated the previously undefeated highly ranked contender David Tua in 1997 and another highly ranked contender and future world champion Chris Byrd in 1999. He was ranked by BoxRec as the world's No.8 heavyweight in 1997 and 1998, and as No.10 heavyweight in 1999. After compiling an impressive record of 20–0 with 15 knockouts, Ibeabuchi's natural talent and potential inside the ring was eventually overshadowed by emotional instability and violent tendencies in his personal life. After a series of run-ins with law enforcement, he was imprisoned in Las Vegas in July 1999, after submitting an Alford plea for charges on sexual misconduct. This also marked the end of his professional boxing career. In November 2015, Ibeabuchi was released from the custody of United States Immigration and Customs Enforcement after completing his 16-year Nevada state prison sentence without incident. He announced his desire to return to the ring to resume his professional boxing career, but was rearrested before his comeback could take place."
    },
    {
      "id": 4,
      "name": "Lennox Lewis",
      "height": "196 cm",
      "weight": "112 kg",
      "reach": "213 cm",
      "anthropometricBonus": "4.5",
      "punchingPower": "10",
      "defense": "8",
      "chin": "7",
      "intelligence": "9",
      "endurance":"8",
      "speed": "7",
      "total": "53.5",
      "totalFights": "44",
      "wins": "41",
      "winsByKO": "32",
      "losses": "2",
      "draws": "1", 
      "puthImageSkillsFirst": "images/Lennox-Lewis.jpg", 
      "puthImageSkillsSecond": "images/Lennox_Lewis.jpg", 
      "puthImageBio": "images/Lennox-Lewis-info.jpg",
      "bio": "Lennox Claudius Lewis CM CBE (born 2 September 1965) is a boxing commentator and former professional boxer who competed from 1989 to 2003. He is a three-time world heavyweight champion, a two-time lineal champion, and the last heavyweight to hold the undisputed championship. Holding dual British and Canadian citizenship, Lewis represented Canada as an amateur at the 1984 and 1988 Olympics; in the latter, he won a gold medal in the super-heavyweight division."
    },  
    {
      "id": 5,
      "name": "Vitaliy Klitschko",
      "height": "201 cm",
      "weight": "112 kg",
      "reach": "203 cm",
      "anthropometricBonus": "4",
      "punchingPower": "8",
      "defense": "8",
      "chin": "10",
      "intelligence": "9",
      "endurance":"8",
      "speed": "6",
      "total": "53",
      "totalFights": "47",
      "wins": "45",
      "winsByKO": "41",
      "losses": "2",
      "draws": "", 
      "puthImageSkillsFirst": "images/Vitaliy_Klitschko.jpg", 
      "puthImageSkillsSecond": "images/Vitaliy-Klitschko.jpg", 
      "puthImageBio": "images/Vitaliy-Klitschko-info.jpg",
      "bio": "As a boxer, Klitschko won multiple world heavyweight championships. He held the World Boxing Organization (WBO) title from 1999 to 2000, the Ring magazine title from 2004 to 2005, and the World Boxing Council (WBC) title twice between 2004 and 2013. Overall, he defeated 15 opponents in world heavyweight title fights, and made 12 successful title defences. In 2011, Vitali and his younger brother Wladimir Klitschko entered the Guinness World Records as the pair of brothers with most world heavyweight title fight wins (30 at the time; 40 as of 2020). From 2006 until 2015, Vitali and Wladimir (also a multiple world champion) dominated heavyweight boxing, a period widely known as the 'Klitschko Era' of the division. Klitschko's last fight was in 2012, but he remained the WBC heavyweight champion at age 42 when he announced his retirement in December 2013."
    },
    {
      "id": 6,
      "name": "Riddick Bowe",
      "height": "196 cm",
      "weight": "107 kg",
      "reach": "206 cm",
      "anthropometricBonus": "4",
      "punchingPower": "9",
      "defense": "7",
      "chin": "9",
      "intelligence": "7",
      "endurance":"8",
      "speed": "8",
      "total": "52",
      "totalFights": "45",
      "wins": "43",
      "winsByKO": "33",
      "losses": "1",
      "draws": "", 
      "puthImageSkillsFirst": "images/Riddick_Bowe.jpg", 
      "puthImageSkillsSecond": "images/Riddick-Bowe.jpg", 
      "puthImageBio": "images/Riddick-Bowe-info.jpg",
      "bio": "Riddick Lamont Bowe (born August 10, 1967) is an American former professional boxer who competed between 1989 and 2008. He held the undisputed world heavyweight championship in 1992, and won the super heavyweight silver medal at the 1988 Summer Olympics."
    },
    {
      "id": 7,
      "name": "Oleksandr Usyk",
      "height": "191 cm",
      "weight": "100 kg",
      "reach": "198 cm",
      "anthropometricBonus": "3",
      "punchingPower": "5",
      "defense": "8",
      "chin": "8",
      "intelligence": "10",
      "endurance":"10",
      "speed": "8",
      "total": "52",
      "totalFights": "22",
      "wins": "22",
      "winsByKO": "14",
      "losses": "0",
      "draws": "0", 
      "puthImageSkillsFirst": "images/Oleksandr_Usyk.jpg", 
      "puthImageSkillsSecond": "images/Oleksandr-Usyk.jpg", 
      "puthImageBio": "images/Oleksandr-Usyk-info.jpg",
      "bio": "Oleksandr Oleksandrovych Usyk is a Ukrainian professional boxer. He is the undisputed heavyweight champion, holding the WBA (Super), IBF and WBO titles since 2021, the Ring magazine title since 2022, and the WBC title since 2024. Previously, he held the undisputed[a] cruiserweight championship from 2018 to 2019. In both the heavyweight and cruiserweight divisions, he is the first boxer to hold all four major world titles. Usyk is only the third male boxer in history (after Terence Crawford and Naoya Inoue) to become the undisputed champion in two weight classes in the four-belt era."
    },
    {
      "id": 8,
      "name": "Evander Holyfield",
      "height": "189 cm",
      "weight": "98 kg",
      "reach": "197 cm",
      "anthropometricBonus": "2.5",
      "punchingPower": "7",
      "defense": "8",
      "chin": "8",
      "intelligence": "9",
      "endurance":"9",
      "speed": "8",
      "total": "51.5",
      "totalFights": "55",
      "wins": "43",
      "winsByKO": "28",
      "losses": "10",
      "draws": "2", 
      "puthImageSkillsFirst": "images/Evander_Holyfield.jpg", 
      "puthImageSkillsSecond": "images/Evander-Holyfield.jpg", 
      "puthImageBio": "images/Evander-Holyfield-info.jpg",
      "bio": "Evander Holyfield (born October 19, 1962) is an American former professional boxer who competed between 1984 and 2011. He reigned as the undisputed champion at cruiserweight in the late 1980s and at heavyweight in the early 1990s, and is the only boxer in history to win the undisputed championship in two weight classes in the three belt era. Nicknamed 'the Real Deal', Holyfield is the only four-time world heavyweight champion, having held the unified WBA, WBC, and IBF titles from 1990 to 1992, the WBA and IBF titles again from 1993 to 1994, the WBA title a third time from 1996 to 1999; the IBF title a third time from 1997 to 1999 and the WBA title for a fourth time from 2000 to 2001."
    },
    {
      "id": 9,
      "name": "Mike Tyson",
      "height": "178 cm",
      "weight": "96 kg",
      "reach": "178 cm",
      "anthropometricBonus": "0",
      "punchingPower": "8",
      "defense": "9",
      "chin": "8",
      "intelligence": "9",
      "endurance":"8",
      "speed": "9",
      "total": "51",
      "totalFights": "59",
      "wins": "50",
      "winsByKO": "44",
      "losses": "6",
      "draws": "1", 
      "puthImageSkillsFirst": "images/Mike_Tyson.jpg", 
      "puthImageSkillsSecond": "images/Mike-Tyson.jpg", 
      "puthImageBio": "images/Mike-Tyson-info.jpg", 
      "bio": "Michael Gerard Tyson (born June 30, 1966) is an American former professional boxer who competed from 1985 to 2005. Nicknamed 'Iron Mike' Tyson is regarded as one of the greatest heavyweight boxers of all time. He reigned as the undisputed world heavyweight champion from 1987 to 1990. Tyson won his first 19 professional fights by knockout, 12 of them in the first round. Claiming his first belt at 20 years, 4 months, and 22 days old, Tyson holds the record as the youngest boxer ever to win a heavyweight title. He was the first heavyweight boxer to simultaneously hold the WBA, WBC and IBF titles, as well as the only heavyweight to unify them in succession. The following year, Tyson became the lineal champion when he knocked out Michael Spinks in 91 seconds of the first round. In 1990, Tyson was knocked out by underdog Buster Douglas in one of the biggest upsets in boxing history."
    },
    {
      "id": 10,
      "name": "Joe Frazier",
      "height": "182 cm",
      "weight": "93 kg",
      "reach": "187 cm",
      "anthropometricBonus": "1",
      "punchingPower": "7",
      "defense": "8",
      "chin": "8",
      "intelligence": "8",
      "endurance":"10",
      "speed": "8",
      "total": "50",
      "totalFights": "37",
      "wins": "32",
      "winsByKO": "27",
      "losses": "4",
      "draws": "1", 
      "puthImageSkillsFirst": "images/Joe_Frazier.jpg", 
      "puthImageSkillsSecond": "images/Joe-Frazier.jpg", 
      "puthImageBio": "images/Joe-Frazier-info.jpg",
      "bio": "Joseph William Frazier (January 12, 1944 – November 7, 2011), nicknamed ``Smokin' Joe``, was an American professional boxer who competed from 1965 to 1981. Widely regarded as one of the greatest heavyweight boxers of all time, he was known for his strength, durability, formidable left hand, and relentless pressure fighting style and was the first boxer to defeat Muhammad Ali. Frazier held the NYSAC heavyweight title from 1968 to 1973 and the undisputed heavyweight champion from 1970 to 1973 and as an amateur won a gold medal at the 1964 Summer Olympics."
    }
  ]
}